rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMROD3_TCM_AXBS_ALARM_MASK      (0x20000U)
#define DCM_GPR_DCMROD3_TCM_AXBS_ALARM_SHIFT     (17U)
#define DCM_GPR_DCMROD3_TCM_AXBS_ALARM_WIDTH     (1U)
#define DCM_GPR_DCMROD3_TCM_AXBS_ALARM(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_TCM_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD3_TCM_AXBS_ALARM_MASK)

#define DCM_GPR_DCMROD3_MAC_GSKT_ALARM_MASK      (0x40000U)
#define DCM_GPR_DCMROD3_MAC_GSKT_ALARM_SHIFT     (18U)
#define DCM_GPR_DCMROD3_MAC_GSKT_ALARM_WIDTH     (1U)
#define DCM_GPR_DCMROD3_MAC_GSKT_ALARM(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_MAC_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD3_MAC_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM_MASK   (0x80000U)
#define DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM_SHIFT  (19U)
#define DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM_MASK)

#define DCM_GPR_DCMROD3_PF3_CODE_ECC_ERR_MASK    (0x100000U)
#define DCM_GPR_DCMROD3_PF3_CODE_ECC_ERR_SHIFT   (20U)
#define DCM_GPR_DCMROD3_PF3_CODE_ECC_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD3_PF3_CODE_ECC_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_PF3_CODE_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_PF3_CODE_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_PF3_DATA_ECC_ERR_MASK    (0x200000U)
#define DCM_GPR_DCMROD3_PF3_DATA_ECC_ERR_SHIFT   (21U)
#define DCM_GPR_DCMROD3_PF3_DATA_ECC_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD3_PF3_DATA_ECC_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_PF3_DATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_PF3_DATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_LC_ERR_MASK              (0x400000U)
#define DCM_GPR_DCMROD3_LC_ERR_SHIFT             (22U)
#define DCM_GPR_DCMROD3_LC_ERR_WIDTH             (1U)
#define DCM_GPR_DCMROD3_LC_ERR(x)                (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_LC_ERR_SHIFT)) & DCM_GPR_DCMROD3_LC_ERR_MASK)

#define DCM_GPR_DCMROD3_PRAM2_ECC_ERR_MASK       (0x800000U)
#define DCM_GPR_DCMROD3_PRAM2_ECC_ERR_SHIFT      (23U)
#define DCM_GPR_DCMROD3_PRAM2_ECC_ERR_WIDTH      (1U)
#define DCM_GPR_DCMROD3_PRAM2_ECC_ERR(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_PRAM2_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_PRAM2_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_PRAM1_ECC_ERR_MASK       (0x1000000U)
#define DCM_GPR_DCMROD3_PRAM1_ECC_ERR_SHIFT      (24U)
#define DCM_GPR_DCMROD3_PRAM1_ECC_ERR_WIDTH      (1U)
#define DCM_GPR_DCMROD3_PRAM1_ECC_ERR(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_PRAM1_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_PRAM1_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_PRAM0_ECC_ERR_MASK       (0x2000000U)
#define DCM_GPR_DCMROD3_PRAM0_ECC_ERR_SHIFT      (25U)
#define DCM_GPR_DCMROD3_PRAM0_ECC_ERR_WIDTH      (1U)
#define DCM_GPR_DCMROD3_PRAM0_ECC_ERR(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_PRAM0_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_PRAM0_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR_MASK (0x4000000U)
#define DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR_SHIFT (26U)
#define DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR_MASK (0x8000000U)
#define DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR_SHIFT (27U)
#define DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR_MASK (0x10000000U)
#define DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR_SHIFT (28U)
#define DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR_MASK (0x20000000U)
#define DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR_SHIFT (29U)
#define DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR_MASK (0x40000000U)
#define DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR_SHIFT (30U)
#define DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR_MASK (0x80000000U)
#define DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR_SHIFT (31U)
#define DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR_MASK)
/*! @} */

/*! @name DCMROD4 - Read-Only GPR On Destructive Reset 4 */
/*! @{ */

#define DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR_MASK (0x1U)
#define DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR_SHIFT (0U)
#define DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR_MASK (0x2U)
#define DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR_SHIFT (1U)
#define DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR_MASK  (0x4U)
#define DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR_SHIFT (2U)
#define DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR_MASK)

#define DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR_MASK (0x8U)
#define DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR_SHIFT (3U)
#define DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR_MASK)

