rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR_MASK   (0x20000U)
#define DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR_SHIFT  (17U)
#define DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR_MASK (0x40000U)
#define DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR_SHIFT (18U)
#define DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR_MASK (0x80000U)
#define DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR_SHIFT (19U)
#define DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR_MASK (0x100000U)
#define DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR_SHIFT (20U)
#define DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR_MASK (0x200000U)
#define DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR_SHIFT (21U)
#define DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_MASK   (0x400000U)
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_SHIFT  (22U)
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_MASK (0x800000U)
#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_SHIFT (23U)
#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_MASK (0x1000000U)
#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_SHIFT (24U)
#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_MASK (0x2000000U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_SHIFT (25U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_MASK (0x4000000U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_SHIFT (26U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_MASK (0x8000000U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_SHIFT (27U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_MASK (0x10000000U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_SHIFT (28U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_MASK  (0x20000000U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_SHIFT (29U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_MASK (0x40000000U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_SHIFT (30U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_MASK (0x80000000U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_SHIFT (31U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_MASK)
/*! @} */

/*! @name DCMROD6 - Read-Only GPR On Destructive Reset 6 */
/*! @{ */

#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_MASK (0x8U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_SHIFT (3U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_MASK    (0x4000000U)
#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_SHIFT   (26U)
#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_MASK (0x40000000U)
#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_SHIFT (30U)
#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_MASK)
/*! @} */

/*! @name DCMROD7 - Read-Only GPR On Destructive Reset 7 */
/*! @{ */

