rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_MASK    (0x1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_SHIFT   (0U)
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_MASK    (0x2U)
#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_SHIFT   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_MASK    (0x4U)
#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_SHIFT   (2U)
#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_MASK    (0x8U)
#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_SHIFT   (3U)
#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_MASK    (0x10U)
#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_SHIFT   (4U)
#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_MASK    (0x20U)
#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_SHIFT   (5U)
#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_MASK     (0x800U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_SHIFT    (11U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_MASK)

#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_MASK     (0x1000U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_SHIFT    (12U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_MASK)

#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_MASK    (0x10000000U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_SHIFT   (28U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_MASK    (0x20000000U)
#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_SHIFT   (29U)
#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_MASK    (0x40000000U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_SHIFT   (30U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_MASK)
/*! @} */

/*! @name DCMROD8 - Read-Only GPR On Destructive Reset Register */
/*! @{ */

#define DCM_GPR_DCMROD8_CM7_3_LOCKUP_MASK        (0x10U)
#define DCM_GPR_DCMROD8_CM7_3_LOCKUP_SHIFT       (4U)
#define DCM_GPR_DCMROD8_CM7_3_LOCKUP_WIDTH       (1U)
#define DCM_GPR_DCMROD8_CM7_3_LOCKUP(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_LOCKUP_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_LOCKUP_MASK)

#define DCM_GPR_DCMROD8_CM7_2_RCCU1_ALARM_MASK   (0x20U)
#define DCM_GPR_DCMROD8_CM7_2_RCCU1_ALARM_SHIFT  (5U)
#define DCM_GPR_DCMROD8_CM7_2_RCCU1_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD8_CM7_2_RCCU1_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_2_RCCU1_ALARM_SHIFT)) & DCM_GPR_DCMROD8_CM7_2_RCCU1_ALARM_MASK)

#define DCM_GPR_DCMROD8_CM7_2_RCCU2_ALARM_MASK   (0x40U)
#define DCM_GPR_DCMROD8_CM7_2_RCCU2_ALARM_SHIFT  (6U)
#define DCM_GPR_DCMROD8_CM7_2_RCCU2_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD8_CM7_2_RCCU2_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_2_RCCU2_ALARM_SHIFT)) & DCM_GPR_DCMROD8_CM7_2_RCCU2_ALARM_MASK)

#define DCM_GPR_DCMROD8_PERIPH_AXBS_S3_GSKT_ALARM_MASK (0x80U)
#define DCM_GPR_DCMROD8_PERIPH_AXBS_S3_GSKT_ALARM_SHIFT (7U)
#define DCM_GPR_DCMROD8_PERIPH_AXBS_S3_GSKT_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD8_PERIPH_AXBS_S3_GSKT_ALARM(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_PERIPH_AXBS_S3_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_PERIPH_AXBS_S3_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD8_MAC2_GSKT_ALARM_MASK     (0x200U)
#define DCM_GPR_DCMROD8_MAC2_GSKT_ALARM_SHIFT    (9U)
#define DCM_GPR_DCMROD8_MAC2_GSKT_ALARM_WIDTH    (1U)
#define DCM_GPR_DCMROD8_MAC2_GSKT_ALARM(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_MAC2_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_MAC2_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD8_MAC2_RDATA_EDC_ERR_MASK  (0x400U)
#define DCM_GPR_DCMROD8_MAC2_RDATA_EDC_ERR_SHIFT (10U)
#define DCM_GPR_DCMROD8_MAC2_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_MAC2_RDATA_EDC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_MAC2_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD8_MAC2_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_AHBP_RDATA_EDC_ERR_MASK (0x800U)
#define DCM_GPR_DCMROD8_CM7_3_AHBP_RDATA_EDC_ERR_SHIFT (11U)
#define DCM_GPR_DCMROD8_CM7_3_AHBP_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_AHBP_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_AHBP_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_AHBP_RDATA_EDC_ERR_MASK)

