rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMROD8_CM7_3_AHBM_RDATA_EDC_ERR_MASK (0x1000U)
#define DCM_GPR_DCMROD8_CM7_3_AHBM_RDATA_EDC_ERR_SHIFT (12U)
#define DCM_GPR_DCMROD8_CM7_3_AHBM_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_AHBM_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_AHBM_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_AHBM_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD8_HSE_AES_ACCEL_AXBS_ALARM_MASK (0x2000U)
#define DCM_GPR_DCMROD8_HSE_AES_ACCEL_AXBS_ALARM_SHIFT (13U)
#define DCM_GPR_DCMROD8_HSE_AES_ACCEL_AXBS_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD8_HSE_AES_ACCEL_AXBS_ALARM(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_HSE_AES_ACCEL_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD8_HSE_AES_ACCEL_AXBS_ALARM_MASK)

#define DCM_GPR_DCMROD8_CM7_3_AHBS_ALARM_MASK    (0x4000U)
#define DCM_GPR_DCMROD8_CM7_3_AHBS_ALARM_SHIFT   (14U)
#define DCM_GPR_DCMROD8_CM7_3_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD8_CM7_3_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_AHBS_ALARM_MASK)

#define DCM_GPR_DCMROD8_ACE_RESULT_RDATA_EDC_ERR_MASK (0x10000U)
#define DCM_GPR_DCMROD8_ACE_RESULT_RDATA_EDC_ERR_SHIFT (16U)
#define DCM_GPR_DCMROD8_ACE_RESULT_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_ACE_RESULT_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_ACE_RESULT_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD8_ACE_RESULT_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD8_ACE_FEED_RDATA_EDC_ERR_MASK (0x20000U)
#define DCM_GPR_DCMROD8_ACE_FEED_RDATA_EDC_ERR_SHIFT (17U)
#define DCM_GPR_DCMROD8_ACE_FEED_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_ACE_FEED_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_ACE_FEED_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD8_ACE_FEED_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD8_AES_ACCEL_AXBS_ALARM_MASK (0x40000U)
#define DCM_GPR_DCMROD8_AES_ACCEL_AXBS_ALARM_SHIFT (18U)
#define DCM_GPR_DCMROD8_AES_ACCEL_AXBS_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD8_AES_ACCEL_AXBS_ALARM(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_AES_ACCEL_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD8_AES_ACCEL_AXBS_ALARM_MASK)

#define DCM_GPR_DCMROD8_AES_ACCEL_GSKT_ALARM_MASK (0x80000U)
#define DCM_GPR_DCMROD8_AES_ACCEL_GSKT_ALARM_SHIFT (19U)
#define DCM_GPR_DCMROD8_AES_ACCEL_GSKT_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD8_AES_ACCEL_GSKT_ALARM(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_AES_ACCEL_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_AES_ACCEL_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD8_CM7_3_AHBM_ALARM_MASK    (0x200000U)
#define DCM_GPR_DCMROD8_CM7_3_AHBM_ALARM_SHIFT   (21U)
#define DCM_GPR_DCMROD8_CM7_3_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD8_CM7_3_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD8_CM7_3_AHBP_ALARM_MASK    (0x400000U)
#define DCM_GPR_DCMROD8_CM7_3_AHBP_ALARM_SHIFT   (22U)
#define DCM_GPR_DCMROD8_CM7_3_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD8_CM7_3_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD8_CM7_3_DCDATA_ECC_ERR_MASK (0x800000U)
#define DCM_GPR_DCMROD8_CM7_3_DCDATA_ECC_ERR_SHIFT (23U)
#define DCM_GPR_DCMROD8_CM7_3_DCDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_DCDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_DCDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_DCDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_DCTAG_ECC_ERR_MASK (0x1000000U)
#define DCM_GPR_DCMROD8_CM7_3_DCTAG_ECC_ERR_SHIFT (24U)
#define DCM_GPR_DCMROD8_CM7_3_DCTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_DCTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_DCTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_DCTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_ICDATA_ECC_ERR_MASK (0x2000000U)
#define DCM_GPR_DCMROD8_CM7_3_ICDATA_ECC_ERR_SHIFT (25U)
#define DCM_GPR_DCMROD8_CM7_3_ICDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_ICDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_ICDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_ICDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_ICTAG_ECC_ERR_MASK (0x4000000U)
#define DCM_GPR_DCMROD8_CM7_3_ICTAG_ECC_ERR_SHIFT (26U)
#define DCM_GPR_DCMROD8_CM7_3_ICTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_ICTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_ICTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_ICTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_ITCM_ECC_ERR_MASK  (0x8000000U)
#define DCM_GPR_DCMROD8_CM7_3_ITCM_ECC_ERR_SHIFT (27U)
#define DCM_GPR_DCMROD8_CM7_3_ITCM_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_ITCM_ECC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_ITCM_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_ITCM_ECC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_DTCM0_ECC_ERR_MASK (0x10000000U)
#define DCM_GPR_DCMROD8_CM7_3_DTCM0_ECC_ERR_SHIFT (28U)
#define DCM_GPR_DCMROD8_CM7_3_DTCM0_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_DTCM0_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_DTCM0_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_DTCM0_ECC_ERR_MASK)

#define DCM_GPR_DCMROD8_CM7_3_DTCM1_ECC_ERR_MASK (0x20000000U)
#define DCM_GPR_DCMROD8_CM7_3_DTCM1_ECC_ERR_SHIFT (29U)
#define DCM_GPR_DCMROD8_CM7_3_DTCM1_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD8_CM7_3_DTCM1_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_CM7_3_DTCM1_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD8_CM7_3_DTCM1_ECC_ERR_MASK)
/*! @} */

/*! @name DCMROD9 - Read-Only GPR On Destructive Reset 9 */
/*! @{ */

#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ECC_ERR_MASK (0x1U)
#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ECC_ERR_SHIFT (0U)
#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ECC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ECC_ERR_MASK)

#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ADDR_ECC_ERR_MASK (0x2U)
#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ADDR_ECC_ERR_SHIFT (1U)
#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ADDR_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ADDR_ECC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ADDR_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD9_AES_FEED_DMA_TCD_ADDR_ECC_ERR_MASK)

