rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ECC_ERR_MASK (0x4U)
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ECC_ERR_SHIFT (2U)
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ECC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ECC_ERR_MASK)

#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_MASK (0x8U)
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_SHIFT (3U)
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ADDR_ECC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD9_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_MASK)

#define DCM_GPR_DCMROD9_AES_FEED_DID_SAFETY_ERR_MASK (0x20U)
#define DCM_GPR_DCMROD9_AES_FEED_DID_SAFETY_ERR_SHIFT (5U)
#define DCM_GPR_DCMROD9_AES_FEED_DID_SAFETY_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD9_AES_FEED_DID_SAFETY_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD9_AES_FEED_DID_SAFETY_ERR_SHIFT)) & DCM_GPR_DCMROD9_AES_FEED_DID_SAFETY_ERR_MASK)

#define DCM_GPR_DCMROD9_AES_RESULT_DID_SAFETY_ERR_MASK (0x40U)
#define DCM_GPR_DCMROD9_AES_RESULT_DID_SAFETY_ERR_SHIFT (6U)
#define DCM_GPR_DCMROD9_AES_RESULT_DID_SAFETY_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD9_AES_RESULT_DID_SAFETY_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD9_AES_RESULT_DID_SAFETY_ERR_SHIFT)) & DCM_GPR_DCMROD9_AES_RESULT_DID_SAFETY_ERR_MASK)
/*! @} */

/*! @name DCMROF1 - Read-Only GPR On Functional Reset 1 */
/*! @{ */

#define DCM_GPR_DCMROF1_MAC_MDC_CHID_0_MASK      (0x1U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_0_SHIFT     (0U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_0_WIDTH     (1U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_0(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_MAC_MDC_CHID_0_SHIFT)) & DCM_GPR_DCMROF1_MAC_MDC_CHID_0_MASK)

#define DCM_GPR_DCMROF1_MAC_MDC_CHID_1_MASK      (0x2U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_1_SHIFT     (1U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_1_WIDTH     (1U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_1(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_MAC_MDC_CHID_1_SHIFT)) & DCM_GPR_DCMROF1_MAC_MDC_CHID_1_MASK)

#define DCM_GPR_DCMROF1_MAC_MDC_CHID_2_MASK      (0x4U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_2_SHIFT     (2U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_2_WIDTH     (1U)
#define DCM_GPR_DCMROF1_MAC_MDC_CHID_2(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_MAC_MDC_CHID_2_SHIFT)) & DCM_GPR_DCMROF1_MAC_MDC_CHID_2_MASK)

#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_0_MASK     (0x8U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_0_SHIFT    (3U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_0_WIDTH    (1U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_0(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_MAC1_MDC_CHID_0_SHIFT)) & DCM_GPR_DCMROF1_MAC1_MDC_CHID_0_MASK)

#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_1_MASK     (0x10U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_1_SHIFT    (4U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_1_WIDTH    (1U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_1(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_MAC1_MDC_CHID_1_SHIFT)) & DCM_GPR_DCMROF1_MAC1_MDC_CHID_1_MASK)

#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_2_MASK     (0x20U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_2_SHIFT    (5U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_2_WIDTH    (1U)
#define DCM_GPR_DCMROF1_MAC1_MDC_CHID_2(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_MAC1_MDC_CHID_2_SHIFT)) & DCM_GPR_DCMROF1_MAC1_MDC_CHID_2_MASK)

#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_PRIV_MASK (0x100U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_PRIV_SHIFT (8U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_PRIV_WIDTH (1U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_PRIV(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_SAFETY_ERR_PRIV_SHIFT)) & DCM_GPR_DCMROF1_AES_SAFETY_ERR_PRIV_MASK)

#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_NS_MASK   (0x200U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_NS_SHIFT  (9U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_NS_WIDTH  (1U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_NS(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_SAFETY_ERR_NS_SHIFT)) & DCM_GPR_DCMROF1_AES_SAFETY_ERR_NS_MASK)

#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_DID_MASK  (0x3C00U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_DID_SHIFT (10U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_DID_WIDTH (4U)
#define DCM_GPR_DCMROF1_AES_SAFETY_ERR_DID(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_SAFETY_ERR_DID_SHIFT)) & DCM_GPR_DCMROF1_AES_SAFETY_ERR_DID_MASK)

#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_PRIV_MASK (0x10000U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_PRIV_SHIFT (16U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_PRIV_WIDTH (1U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_PRIV(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_FEED_DID_ERR_PRIV_SHIFT)) & DCM_GPR_DCMROF1_AES_FEED_DID_ERR_PRIV_MASK)

#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_NS_MASK (0x20000U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_NS_SHIFT (17U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_NS_WIDTH (1U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_NS(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_FEED_DID_ERR_NS_SHIFT)) & DCM_GPR_DCMROF1_AES_FEED_DID_ERR_NS_MASK)

#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_DID_MASK (0x3C0000U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_DID_SHIFT (18U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_DID_WIDTH (4U)
#define DCM_GPR_DCMROF1_AES_FEED_DID_ERR_DID(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_FEED_DID_ERR_DID_SHIFT)) & DCM_GPR_DCMROF1_AES_FEED_DID_ERR_DID_MASK)

#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_PRIV_MASK (0x1000000U)
#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_PRIV_SHIFT (24U)
#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_PRIV_WIDTH (1U)
#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_PRIV(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_PRIV_SHIFT)) & DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_PRIV_MASK)

#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_NS_MASK (0x2000000U)
#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_NS_SHIFT (25U)
#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_NS_WIDTH (1U)
#define DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_NS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_NS_SHIFT)) & DCM_GPR_DCMROF1_AES_RESULT_DID_ERR_NS_MASK)

