rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWD5_SW_NCF_3_EN_MASK         (0x100U)
#define DCM_GPR_DCMRWD5_SW_NCF_3_EN_SHIFT        (8U)
#define DCM_GPR_DCMRWD5_SW_NCF_3_EN_WIDTH        (1U)
#define DCM_GPR_DCMRWD5_SW_NCF_3_EN(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_SW_NCF_3_EN_SHIFT)) & DCM_GPR_DCMRWD5_SW_NCF_3_EN_MASK)

#define DCM_GPR_DCMRWD5_STCU_NCF_EN_MASK         (0x200U)
#define DCM_GPR_DCMRWD5_STCU_NCF_EN_SHIFT        (9U)
#define DCM_GPR_DCMRWD5_STCU_NCF_EN_WIDTH        (1U)
#define DCM_GPR_DCMRWD5_STCU_NCF_EN(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_STCU_NCF_EN_SHIFT)) & DCM_GPR_DCMRWD5_STCU_NCF_EN_MASK)

#define DCM_GPR_DCMRWD5_MBIST_ACTIVATION_ERR_EN_MASK (0x400U)
#define DCM_GPR_DCMRWD5_MBIST_ACTIVATION_ERR_EN_SHIFT (10U)
#define DCM_GPR_DCMRWD5_MBIST_ACTIVATION_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_MBIST_ACTIVATION_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_MBIST_ACTIVATION_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_MBIST_ACTIVATION_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_STCU_BIST_USER_CF_EN_MASK (0x800U)
#define DCM_GPR_DCMRWD5_STCU_BIST_USER_CF_EN_SHIFT (11U)
#define DCM_GPR_DCMRWD5_STCU_BIST_USER_CF_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_STCU_BIST_USER_CF_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_STCU_BIST_USER_CF_EN_SHIFT)) & DCM_GPR_DCMRWD5_STCU_BIST_USER_CF_EN_MASK)

#define DCM_GPR_DCMRWD5_MCT_BUS_ERR_EN_MASK      (0x1000U)
#define DCM_GPR_DCMRWD5_MCT_BUS_ERR_EN_SHIFT     (12U)
#define DCM_GPR_DCMRWD5_MCT_BUS_ERR_EN_WIDTH     (1U)
#define DCM_GPR_DCMRWD5_MCT_BUS_ERR_EN(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_MCT_BUS_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_MCT_BUS_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_DEBUG_ACTIVATION_ERR_EN_MASK (0x2000U)
#define DCM_GPR_DCMRWD5_DEBUG_ACTIVATION_ERR_EN_SHIFT (13U)
#define DCM_GPR_DCMRWD5_DEBUG_ACTIVATION_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_DEBUG_ACTIVATION_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_DEBUG_ACTIVATION_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_DEBUG_ACTIVATION_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_MAC_RDATA_EDC_ERR_EN_MASK (0x8000U)
#define DCM_GPR_DCMRWD5_MAC_RDATA_EDC_ERR_EN_SHIFT (15U)
#define DCM_GPR_DCMRWD5_MAC_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_MAC_RDATA_EDC_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_MAC_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_MAC_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_MASK (0x20000U)
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_SHIFT (17U)
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_MASK (0x100000U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_SHIFT (20U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_MASK (0x200000U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_SHIFT (21U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_MASK (0x800000U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_SHIFT (23U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_MASK (0x1000000U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_SHIFT (24U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_MASK (0x2000000U)
#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_SHIFT (25U)
#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_MASK (0x4000000U)
#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_SHIFT (26U)
#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_MASK (0x8000000U)
#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_SHIFT (27U)
#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_MASK (0x10000000U)
#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_SHIFT (28U)
#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_MASK (0x20000000U)
#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_SHIFT (29U)
#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_MASK)

