rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWD7_SWT3_DBG_DIS_CM7_0_MASK  (0x200000U)
#define DCM_GPR_DCMRWD7_SWT3_DBG_DIS_CM7_0_SHIFT (21U)
#define DCM_GPR_DCMRWD7_SWT3_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SWT3_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SWT3_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SWT3_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_STM3_DBG_DIS_CM7_0_MASK  (0x400000U)
#define DCM_GPR_DCMRWD7_STM3_DBG_DIS_CM7_0_SHIFT (22U)
#define DCM_GPR_DCMRWD7_STM3_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_STM3_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_STM3_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_STM3_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_PIT3_DBG_DIS_CM7_0_MASK  (0x800000U)
#define DCM_GPR_DCMRWD7_PIT3_DBG_DIS_CM7_0_SHIFT (23U)
#define DCM_GPR_DCMRWD7_PIT3_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_PIT3_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_PIT3_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_PIT3_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_FLEXCAN9_DBG_DIS_CM7_0_MASK (0x2000000U)
#define DCM_GPR_DCMRWD7_FLEXCAN9_DBG_DIS_CM7_0_SHIFT (25U)
#define DCM_GPR_DCMRWD7_FLEXCAN9_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_FLEXCAN9_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_FLEXCAN9_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_FLEXCAN9_DBG_DIS_CM7_0_MASK)
/*! @} */

/*! @name DCMRWD8 - Read Write GPR On Destructive Reset 8 */
/*! @{ */

#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_MASK  (0x1U)
#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_SHIFT (0U)
#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_MASK  (0x2U)
#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_SHIFT (1U)
#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_MASK  (0x4U)
#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_SHIFT (2U)
#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_MASK  (0x8U)
#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_SHIFT (3U)
#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_MASK (0x10U)
#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_SHIFT (4U)
#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_MASK (0x20U)
#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_SHIFT (5U)
#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_EMIOS2_DBG_DIS_CM7_1_MASK (0x40U)
#define DCM_GPR_DCMRWD8_EMIOS2_DBG_DIS_CM7_1_SHIFT (6U)
#define DCM_GPR_DCMRWD8_EMIOS2_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EMIOS2_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EMIOS2_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EMIOS2_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_MASK   (0x80U)
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_SHIFT  (7U)
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_WIDTH  (1U)
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_MASK  (0x100U)
#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_SHIFT (8U)
#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_MASK  (0x200U)
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_SHIFT (9U)
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_MASK  (0x400U)
#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_SHIFT (10U)
#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_MASK  (0x800U)
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_SHIFT (11U)
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_MASK  (0x1000U)
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_SHIFT (12U)
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_MASK  (0x2000U)
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_SHIFT (13U)
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_MASK  (0x4000U)
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_SHIFT (14U)
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_MASK)

