rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_MASK (0x10000U)
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_SHIFT (16U)
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_MASK (0x20000U)
#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_SHIFT (17U)
#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_MASK (0x40000U)
#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_SHIFT (18U)
#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_MASK (0x80000U)
#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_SHIFT (19U)
#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_MASK (0x100000U)
#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_SHIFT (20U)
#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_MASK (0x200000U)
#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_SHIFT (21U)
#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_MASK (0x400000U)
#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_SHIFT (22U)
#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_MASK (0x800000U)
#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_SHIFT (23U)
#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_MASK (0x1000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_SHIFT (24U)
#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_MASK (0x2000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_SHIFT (25U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_MASK (0x4000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_SHIFT (26U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_MASK (0x8000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_SHIFT (27U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_MASK (0x10000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_SHIFT (28U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_MASK (0x20000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_SHIFT (29U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_SAI0_DBG_DIS_CM7_2_MASK (0x40000000U)
#define DCM_GPR_DCMRWD12_SAI0_DBG_DIS_CM7_2_SHIFT (30U)
#define DCM_GPR_DCMRWD12_SAI0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_SAI0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_SAI0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_SAI0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_SAI1_DBG_DIS_CM7_2_MASK (0x80000000U)
#define DCM_GPR_DCMRWD12_SAI1_DBG_DIS_CM7_2_SHIFT (31U)
#define DCM_GPR_DCMRWD12_SAI1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_SAI1_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_SAI1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_SAI1_DBG_DIS_CM7_2_MASK)
/*! @} */

/*! @name DCMRWD13 - Read Write GPR On Destructive Reset 13 */
/*! @{ */

#define DCM_GPR_DCMRWD13_FLEXCAN6_DBG_DIS_CM7_2_MASK (0x2U)
#define DCM_GPR_DCMRWD13_FLEXCAN6_DBG_DIS_CM7_2_SHIFT (1U)
#define DCM_GPR_DCMRWD13_FLEXCAN6_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_FLEXCAN6_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_FLEXCAN6_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_FLEXCAN6_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_FLEXCAN7_DBG_DIS_CM7_2_MASK (0x4U)
#define DCM_GPR_DCMRWD13_FLEXCAN7_DBG_DIS_CM7_2_SHIFT (2U)
#define DCM_GPR_DCMRWD13_FLEXCAN7_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_FLEXCAN7_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_FLEXCAN7_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_FLEXCAN7_DBG_DIS_CM7_2_MASK)

