rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_MASK (0x8U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_SHIFT (3U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_MASK (0x10U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_SHIFT (4U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SWT3_DBG_DIS_CM7_2_MASK (0x200000U)
#define DCM_GPR_DCMRWD13_SWT3_DBG_DIS_CM7_2_SHIFT (21U)
#define DCM_GPR_DCMRWD13_SWT3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SWT3_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SWT3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SWT3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_STM3_DBG_DIS_CM7_2_MASK (0x400000U)
#define DCM_GPR_DCMRWD13_STM3_DBG_DIS_CM7_2_SHIFT (22U)
#define DCM_GPR_DCMRWD13_STM3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_STM3_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_STM3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_STM3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_PIT3_DBG_DIS_CM7_2_MASK (0x800000U)
#define DCM_GPR_DCMRWD13_PIT3_DBG_DIS_CM7_2_SHIFT (23U)
#define DCM_GPR_DCMRWD13_PIT3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_PIT3_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_PIT3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_PIT3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_FLEXCAN9_DBG_DIS_CM7_2_MASK (0x2000000U)
#define DCM_GPR_DCMRWD13_FLEXCAN9_DBG_DIS_CM7_2_SHIFT (25U)
#define DCM_GPR_DCMRWD13_FLEXCAN9_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_FLEXCAN9_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_FLEXCAN9_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_FLEXCAN9_DBG_DIS_CM7_2_MASK)
/*! @} */

/*! @name DCMRWD14 - Read Write GPR On Destructive Reset 14 */
/*! @{ */

#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_MASK (0x8U)
#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_SHIFT (3U)
#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_AIPS0_GSKT_ALARM_EN_MASK (0x4000000U)
#define DCM_GPR_DCMRWD14_AIPS0_GSKT_ALARM_EN_SHIFT (26U)
#define DCM_GPR_DCMRWD14_AIPS0_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_AIPS0_GSKT_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_AIPS0_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_AIPS0_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_TCM_PRAM_AXBS_ALARM_EN_MASK (0x40000000U)
#define DCM_GPR_DCMRWD14_TCM_PRAM_AXBS_ALARM_EN_SHIFT (30U)
#define DCM_GPR_DCMRWD14_TCM_PRAM_AXBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_TCM_PRAM_AXBS_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_TCM_PRAM_AXBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_TCM_PRAM_AXBS_ALARM_EN_MASK)
/*! @} */

/*! @name DCMRWD15 - Read Write GPR On Destructive Reset 15 */
/*! @{ */

#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_MASK (0x1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_SHIFT (0U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_MASK (0x2U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_SHIFT (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_MASK (0x4U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_SHIFT (2U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_MASK (0x8U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_SHIFT (3U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_MASK (0x10U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_SHIFT (4U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_MASK (0x20U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_SHIFT (5U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_MASK (0x800U)
#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_SHIFT (11U)
#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_MASK (0x1000U)
#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_SHIFT (12U)
#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_MASK (0x10000000U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_SHIFT (28U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_MASK (0x40000000U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_SHIFT (30U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_MASK)
/*! @} */

