rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
/*! @name DCMRWD16 - Read Write GPR On Destructive Reset 16 */
/*! @{ */

#define DCM_GPR_DCMRWD16_CM7_3_LOCKUP_EN_MASK    (0x10U)
#define DCM_GPR_DCMRWD16_CM7_3_LOCKUP_EN_SHIFT   (4U)
#define DCM_GPR_DCMRWD16_CM7_3_LOCKUP_EN_WIDTH   (1U)
#define DCM_GPR_DCMRWD16_CM7_3_LOCKUP_EN(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_LOCKUP_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_LOCKUP_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_2_RCCU1_ALARM_EN_MASK (0x20U)
#define DCM_GPR_DCMRWD16_CM7_2_RCCU1_ALARM_EN_SHIFT (5U)
#define DCM_GPR_DCMRWD16_CM7_2_RCCU1_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_2_RCCU1_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_2_RCCU1_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_2_RCCU1_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_2_RCCU2_ALARM_EN_MASK (0x40U)
#define DCM_GPR_DCMRWD16_CM7_2_RCCU2_ALARM_EN_SHIFT (6U)
#define DCM_GPR_DCMRWD16_CM7_2_RCCU2_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_2_RCCU2_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_2_RCCU2_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_2_RCCU2_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_PERIPH_AXBS_S3_GSKT_ALARM_EN_MASK (0x80U)
#define DCM_GPR_DCMRWD16_PERIPH_AXBS_S3_GSKT_ALARM_EN_SHIFT (7U)
#define DCM_GPR_DCMRWD16_PERIPH_AXBS_S3_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_PERIPH_AXBS_S3_GSKT_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_PERIPH_AXBS_S3_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_PERIPH_AXBS_S3_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_MAC2_GSKT_ALARM_EN_MASK (0x200U)
#define DCM_GPR_DCMRWD16_MAC2_GSKT_ALARM_EN_SHIFT (9U)
#define DCM_GPR_DCMRWD16_MAC2_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_MAC2_GSKT_ALARM_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_MAC2_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_MAC2_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_MAC2_RDATA_EDC_ERR_EN_MASK (0x400U)
#define DCM_GPR_DCMRWD16_MAC2_RDATA_EDC_ERR_EN_SHIFT (10U)
#define DCM_GPR_DCMRWD16_MAC2_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_MAC2_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_MAC2_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_MAC2_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_AHBP_RDATA_EDC_ERR_EN_MASK (0x800U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBP_RDATA_EDC_ERR_EN_SHIFT (11U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBP_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBP_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_AHBP_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_AHBP_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_AHBM_RDATA_EDC_ERR_EN_MASK (0x1000U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBM_RDATA_EDC_ERR_EN_SHIFT (12U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBM_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBM_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_AHBM_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_AHBM_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_HSE_AES_ACCEL_AXBS_ALARM_EN_MASK (0x2000U)
#define DCM_GPR_DCMRWD16_HSE_AES_ACCEL_AXBS_ALARM_EN_SHIFT (13U)
#define DCM_GPR_DCMRWD16_HSE_AES_ACCEL_AXBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_HSE_AES_ACCEL_AXBS_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_HSE_AES_ACCEL_AXBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_HSE_AES_ACCEL_AXBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_AHBS_ALARM_EN_MASK (0x4000U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBS_ALARM_EN_SHIFT (14U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBS_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_AHBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_AHBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_ACE_RESULT_RDATA_EDC_ERR_EN_MASK (0x10000U)
#define DCM_GPR_DCMRWD16_ACE_RESULT_RDATA_EDC_ERR_EN_SHIFT (16U)
#define DCM_GPR_DCMRWD16_ACE_RESULT_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_ACE_RESULT_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_ACE_RESULT_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_ACE_RESULT_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_ACE_FEED_RDATA_EDC_ERR_EN_MASK (0x20000U)
#define DCM_GPR_DCMRWD16_ACE_FEED_RDATA_EDC_ERR_EN_SHIFT (17U)
#define DCM_GPR_DCMRWD16_ACE_FEED_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_ACE_FEED_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_ACE_FEED_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_ACE_FEED_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_AES_ACCEL_AXBS_ALARM_EN_MASK (0x40000U)
#define DCM_GPR_DCMRWD16_AES_ACCEL_AXBS_ALARM_EN_SHIFT (18U)
#define DCM_GPR_DCMRWD16_AES_ACCEL_AXBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_AES_ACCEL_AXBS_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_AES_ACCEL_AXBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_AES_ACCEL_AXBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_AES_ACCEL_GSKT_ALARM_EN_MASK (0x80000U)
#define DCM_GPR_DCMRWD16_AES_ACCEL_GSKT_ALARM_EN_SHIFT (19U)
#define DCM_GPR_DCMRWD16_AES_ACCEL_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_AES_ACCEL_GSKT_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_AES_ACCEL_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_AES_ACCEL_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_AHBM_ALARM_EN_MASK (0x200000U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBM_ALARM_EN_SHIFT (21U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_AHBP_ALARM_EN_MASK (0x400000U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBP_ALARM_EN_SHIFT (22U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_DCDATA_ECC_ERR_EN_MASK (0x800000U)
#define DCM_GPR_DCMRWD16_CM7_3_DCDATA_ECC_ERR_EN_SHIFT (23U)
#define DCM_GPR_DCMRWD16_CM7_3_DCDATA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_DCDATA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_DCDATA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_DCDATA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_DCTAG_ECC_ERR_EN_MASK (0x1000000U)
#define DCM_GPR_DCMRWD16_CM7_3_DCTAG_ECC_ERR_EN_SHIFT (24U)
#define DCM_GPR_DCMRWD16_CM7_3_DCTAG_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_DCTAG_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_DCTAG_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_DCTAG_ECC_ERR_EN_MASK)

