rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWD16_CM7_3_ICDATA_ECC_ERR_EN_MASK (0x2000000U)
#define DCM_GPR_DCMRWD16_CM7_3_ICDATA_ECC_ERR_EN_SHIFT (25U)
#define DCM_GPR_DCMRWD16_CM7_3_ICDATA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_ICDATA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_ICDATA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_ICDATA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_ICTAG_ECC_ERR_EN_MASK (0x4000000U)
#define DCM_GPR_DCMRWD16_CM7_3_ICTAG_ECC_ERR_EN_SHIFT (26U)
#define DCM_GPR_DCMRWD16_CM7_3_ICTAG_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_ICTAG_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_ICTAG_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_ICTAG_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_ITCM_ECC_ERR_EN_MASK (0x8000000U)
#define DCM_GPR_DCMRWD16_CM7_3_ITCM_ECC_ERR_EN_SHIFT (27U)
#define DCM_GPR_DCMRWD16_CM7_3_ITCM_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_ITCM_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_ITCM_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_ITCM_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_DTCM0_ECC_ERR_EN_MASK (0x10000000U)
#define DCM_GPR_DCMRWD16_CM7_3_DTCM0_ECC_ERR_EN_SHIFT (28U)
#define DCM_GPR_DCMRWD16_CM7_3_DTCM0_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_DTCM0_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_DTCM0_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_DTCM0_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD16_CM7_3_DTCM1_ECC_ERR_EN_MASK (0x20000000U)
#define DCM_GPR_DCMRWD16_CM7_3_DTCM1_ECC_ERR_EN_SHIFT (29U)
#define DCM_GPR_DCMRWD16_CM7_3_DTCM1_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD16_CM7_3_DTCM1_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD16_CM7_3_DTCM1_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD16_CM7_3_DTCM1_ECC_ERR_EN_MASK)
/*! @} */

/*! @name DCMRWD17 - Read Write GPR On Destructive Reset 17 */
/*! @{ */

#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ECC_ERR_EN_MASK (0x1U)
#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ECC_ERR_EN_SHIFT (0U)
#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ADDR_ECC_ERR_EN_MASK (0x2U)
#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ADDR_ECC_ERR_EN_SHIFT (1U)
#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ADDR_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ADDR_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ADDR_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_FEED_DMA_TCD_ADDR_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ECC_ERR_EN_MASK (0x4U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ECC_ERR_EN_SHIFT (2U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_EN_MASK (0x8U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_EN_SHIFT (3U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_RESULT_DMA_TCD_ADDR_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD17_AES_KP_CRC_SAFETY_ERR_EN_MASK (0x10U)
#define DCM_GPR_DCMRWD17_AES_KP_CRC_SAFETY_ERR_EN_SHIFT (4U)
#define DCM_GPR_DCMRWD17_AES_KP_CRC_SAFETY_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_KP_CRC_SAFETY_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_KP_CRC_SAFETY_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_KP_CRC_SAFETY_ERR_EN_MASK)

#define DCM_GPR_DCMRWD17_AES_FEED_DID_SAFETY_ERR_EN_MASK (0x20U)
#define DCM_GPR_DCMRWD17_AES_FEED_DID_SAFETY_ERR_EN_SHIFT (5U)
#define DCM_GPR_DCMRWD17_AES_FEED_DID_SAFETY_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_FEED_DID_SAFETY_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_FEED_DID_SAFETY_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_FEED_DID_SAFETY_ERR_EN_MASK)

#define DCM_GPR_DCMRWD17_AES_RESULT_DID_SAFETY_ERR_EN_MASK (0x40U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DID_SAFETY_ERR_EN_SHIFT (6U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DID_SAFETY_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD17_AES_RESULT_DID_SAFETY_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD17_AES_RESULT_DID_SAFETY_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD17_AES_RESULT_DID_SAFETY_ERR_EN_MASK)
/*! @} */

/*! @name DCMRWD19 - Read Write GPR On Destructive Reset 19 */
/*! @{ */

#define DCM_GPR_DCMRWD19_EDMA_DBG_DIS_CM7_3_MASK (0x1U)
#define DCM_GPR_DCMRWD19_EDMA_DBG_DIS_CM7_3_SHIFT (0U)
#define DCM_GPR_DCMRWD19_EDMA_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_EDMA_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_EDMA_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_EDMA_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_FCCU_DBG_DIS_CM7_3_MASK (0x2U)
#define DCM_GPR_DCMRWD19_FCCU_DBG_DIS_CM7_3_SHIFT (1U)
#define DCM_GPR_DCMRWD19_FCCU_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_FCCU_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_FCCU_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_FCCU_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LCU0_DBG_DIS_CM7_3_MASK (0x4U)
#define DCM_GPR_DCMRWD19_LCU0_DBG_DIS_CM7_3_SHIFT (2U)
#define DCM_GPR_DCMRWD19_LCU0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LCU0_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LCU0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LCU0_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LCU1_DBG_DIS_CM7_3_MASK (0x8U)
#define DCM_GPR_DCMRWD19_LCU1_DBG_DIS_CM7_3_SHIFT (3U)
#define DCM_GPR_DCMRWD19_LCU1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LCU1_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LCU1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LCU1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_eMIOS0_DBG_DIS_CM7_3_MASK (0x10U)
#define DCM_GPR_DCMRWD19_eMIOS0_DBG_DIS_CM7_3_SHIFT (4U)
#define DCM_GPR_DCMRWD19_eMIOS0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_eMIOS0_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_eMIOS0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_eMIOS0_DBG_DIS_CM7_3_MASK)

