rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWD19_eMIOS1_DBG_DIS_CM7_3_MASK (0x20U)
#define DCM_GPR_DCMRWD19_eMIOS1_DBG_DIS_CM7_3_SHIFT (5U)
#define DCM_GPR_DCMRWD19_eMIOS1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_eMIOS1_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_eMIOS1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_eMIOS1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_eMIOS2_DBG_DIS_CM7_3_MASK (0x40U)
#define DCM_GPR_DCMRWD19_eMIOS2_DBG_DIS_CM7_3_SHIFT (6U)
#define DCM_GPR_DCMRWD19_eMIOS2_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_eMIOS2_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_eMIOS2_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_eMIOS2_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_RTC_DBG_DIS_CM7_3_MASK  (0x80U)
#define DCM_GPR_DCMRWD19_RTC_DBG_DIS_CM7_3_SHIFT (7U)
#define DCM_GPR_DCMRWD19_RTC_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_RTC_DBG_DIS_CM7_3(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_RTC_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_RTC_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_SWT0_DBG_DIS_CM7_3_MASK (0x100U)
#define DCM_GPR_DCMRWD19_SWT0_DBG_DIS_CM7_3_SHIFT (8U)
#define DCM_GPR_DCMRWD19_SWT0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_SWT0_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_SWT0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_SWT0_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_SWT1_DBG_DIS_CM7_3_MASK (0x200U)
#define DCM_GPR_DCMRWD19_SWT1_DBG_DIS_CM7_3_SHIFT (9U)
#define DCM_GPR_DCMRWD19_SWT1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_SWT1_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_SWT1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_SWT1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_STM0_DBG_DIS_CM7_3_MASK (0x400U)
#define DCM_GPR_DCMRWD19_STM0_DBG_DIS_CM7_3_SHIFT (10U)
#define DCM_GPR_DCMRWD19_STM0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_STM0_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_STM0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_STM0_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_STM1_DBG_DIS_CM7_3_MASK (0x800U)
#define DCM_GPR_DCMRWD19_STM1_DBG_DIS_CM7_3_SHIFT (11U)
#define DCM_GPR_DCMRWD19_STM1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_STM1_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_STM1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_STM1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_PIT0_DBG_DIS_CM7_3_MASK (0x1000U)
#define DCM_GPR_DCMRWD19_PIT0_DBG_DIS_CM7_3_SHIFT (12U)
#define DCM_GPR_DCMRWD19_PIT0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_PIT0_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_PIT0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_PIT0_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_PIT1_DBG_DIS_CM7_3_MASK (0x2000U)
#define DCM_GPR_DCMRWD19_PIT1_DBG_DIS_CM7_3_SHIFT (13U)
#define DCM_GPR_DCMRWD19_PIT1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_PIT1_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_PIT1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_PIT1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_PIT2_DBG_DIS_CM7_3_MASK (0x4000U)
#define DCM_GPR_DCMRWD19_PIT2_DBG_DIS_CM7_3_SHIFT (14U)
#define DCM_GPR_DCMRWD19_PIT2_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_PIT2_DBG_DIS_CM7_3(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_PIT2_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_PIT2_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPSPI0_DBG_DIS_CM7_3_MASK (0x8000U)
#define DCM_GPR_DCMRWD19_LPSPI0_DBG_DIS_CM7_3_SHIFT (15U)
#define DCM_GPR_DCMRWD19_LPSPI0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPSPI0_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPSPI0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPSPI0_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPSPI1_DBG_DIS_CM7_3_MASK (0x10000U)
#define DCM_GPR_DCMRWD19_LPSPI1_DBG_DIS_CM7_3_SHIFT (16U)
#define DCM_GPR_DCMRWD19_LPSPI1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPSPI1_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPSPI1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPSPI1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPSPI2_DBG_DIS_CM7_3_MASK (0x20000U)
#define DCM_GPR_DCMRWD19_LPSPI2_DBG_DIS_CM7_3_SHIFT (17U)
#define DCM_GPR_DCMRWD19_LPSPI2_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPSPI2_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPSPI2_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPSPI2_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPSPI3_DBG_DIS_CM7_3_MASK (0x40000U)
#define DCM_GPR_DCMRWD19_LPSPI3_DBG_DIS_CM7_3_SHIFT (18U)
#define DCM_GPR_DCMRWD19_LPSPI3_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPSPI3_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPSPI3_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPSPI3_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPSPI4_DBG_DIS_CM7_3_MASK (0x80000U)
#define DCM_GPR_DCMRWD19_LPSPI4_DBG_DIS_CM7_3_SHIFT (19U)
#define DCM_GPR_DCMRWD19_LPSPI4_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPSPI4_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPSPI4_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPSPI4_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPSPI5_DBG_DIS_CM7_3_MASK (0x100000U)
#define DCM_GPR_DCMRWD19_LPSPI5_DBG_DIS_CM7_3_SHIFT (20U)
#define DCM_GPR_DCMRWD19_LPSPI5_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPSPI5_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPSPI5_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPSPI5_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPI2C0_DBG_DIS_CM7_3_MASK (0x200000U)
#define DCM_GPR_DCMRWD19_LPI2C0_DBG_DIS_CM7_3_SHIFT (21U)
#define DCM_GPR_DCMRWD19_LPI2C0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPI2C0_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPI2C0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPI2C0_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_LPI2C1_DBG_DIS_CM7_3_MASK (0x400000U)
#define DCM_GPR_DCMRWD19_LPI2C1_DBG_DIS_CM7_3_SHIFT (22U)
#define DCM_GPR_DCMRWD19_LPI2C1_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_LPI2C1_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_LPI2C1_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_LPI2C1_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_FLEXIO_DBG_DIS_CM7_3_MASK (0x800000U)
#define DCM_GPR_DCMRWD19_FLEXIO_DBG_DIS_CM7_3_SHIFT (23U)
#define DCM_GPR_DCMRWD19_FLEXIO_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_FLEXIO_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_FLEXIO_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_FLEXIO_DBG_DIS_CM7_3_MASK)

#define DCM_GPR_DCMRWD19_FLEXCAN0_DBG_DIS_CM7_3_MASK (0x1000000U)
#define DCM_GPR_DCMRWD19_FLEXCAN0_DBG_DIS_CM7_3_SHIFT (24U)
#define DCM_GPR_DCMRWD19_FLEXCAN0_DBG_DIS_CM7_3_WIDTH (1U)
#define DCM_GPR_DCMRWD19_FLEXCAN0_DBG_DIS_CM7_3(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD19_FLEXCAN0_DBG_DIS_CM7_3_SHIFT)) & DCM_GPR_DCMRWD19_FLEXCAN0_DBG_DIS_CM7_3_MASK)

