rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_DCM_GPR.h
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP_MASK (0x8000U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP_SHIFT (15U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP_WIDTH (1U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP_SHIFT)) & DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP_MASK)

#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP_MASK (0x10000U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP_SHIFT (16U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP_WIDTH (1U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP_SHIFT)) & DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP_MASK)

#define DCM_GPR_DCMRWF4_CM7_0_CPUWAIT_MASK       (0x20000U)
#define DCM_GPR_DCMRWF4_CM7_0_CPUWAIT_SHIFT      (17U)
#define DCM_GPR_DCMRWF4_CM7_0_CPUWAIT_WIDTH      (1U)
#define DCM_GPR_DCMRWF4_CM7_0_CPUWAIT(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_CM7_0_CPUWAIT_SHIFT)) & DCM_GPR_DCMRWF4_CM7_0_CPUWAIT_MASK)

#define DCM_GPR_DCMRWF4_CM7_1_CPUWAIT_MASK       (0x40000U)
#define DCM_GPR_DCMRWF4_CM7_1_CPUWAIT_SHIFT      (18U)
#define DCM_GPR_DCMRWF4_CM7_1_CPUWAIT_WIDTH      (1U)
#define DCM_GPR_DCMRWF4_CM7_1_CPUWAIT(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_CM7_1_CPUWAIT_SHIFT)) & DCM_GPR_DCMRWF4_CM7_1_CPUWAIT_MASK)

#define DCM_GPR_DCMRWF4_CM7_2_CPUWAIT_MASK       (0x80000U)
#define DCM_GPR_DCMRWF4_CM7_2_CPUWAIT_SHIFT      (19U)
#define DCM_GPR_DCMRWF4_CM7_2_CPUWAIT_WIDTH      (1U)
#define DCM_GPR_DCMRWF4_CM7_2_CPUWAIT(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_CM7_2_CPUWAIT_SHIFT)) & DCM_GPR_DCMRWF4_CM7_2_CPUWAIT_MASK)

#define DCM_GPR_DCMRWF4_CM7_3_CPUWAIT_MASK       (0x100000U)
#define DCM_GPR_DCMRWF4_CM7_3_CPUWAIT_SHIFT      (20U)
#define DCM_GPR_DCMRWF4_CM7_3_CPUWAIT_WIDTH      (1U)
#define DCM_GPR_DCMRWF4_CM7_3_CPUWAIT(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_CM7_3_CPUWAIT_SHIFT)) & DCM_GPR_DCMRWF4_CM7_3_CPUWAIT_MASK)

#define DCM_GPR_DCMRWF4_MAC_SB_END_CTRL_MASK     (0x800000U)
#define DCM_GPR_DCMRWF4_MAC_SB_END_CTRL_SHIFT    (23U)
#define DCM_GPR_DCMRWF4_MAC_SB_END_CTRL_WIDTH    (1U)
#define DCM_GPR_DCMRWF4_MAC_SB_END_CTRL(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MAC_SB_END_CTRL_SHIFT)) & DCM_GPR_DCMRWF4_MAC_SB_END_CTRL_MASK)

#define DCM_GPR_DCMRWF4_MAC2_CONF_SEL_MASK       (0x3000000U)
#define DCM_GPR_DCMRWF4_MAC2_CONF_SEL_SHIFT      (24U)
#define DCM_GPR_DCMRWF4_MAC2_CONF_SEL_WIDTH      (2U)
#define DCM_GPR_DCMRWF4_MAC2_CONF_SEL(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MAC2_CONF_SEL_SHIFT)) & DCM_GPR_DCMRWF4_MAC2_CONF_SEL_MASK)

#define DCM_GPR_DCMRWF4_MAC_RMII_CLK_MUX_BYPASS_MASK (0x4000000U)
#define DCM_GPR_DCMRWF4_MAC_RMII_CLK_MUX_BYPASS_SHIFT (26U)
#define DCM_GPR_DCMRWF4_MAC_RMII_CLK_MUX_BYPASS_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MAC_RMII_CLK_MUX_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MAC_RMII_CLK_MUX_BYPASS_SHIFT)) & DCM_GPR_DCMRWF4_MAC_RMII_CLK_MUX_BYPASS_MASK)

#define DCM_GPR_DCMRWF4_MAC2_RMII_CLK_MUX_BYPASS_MASK (0x8000000U)
#define DCM_GPR_DCMRWF4_MAC2_RMII_CLK_MUX_BYPASS_SHIFT (27U)
#define DCM_GPR_DCMRWF4_MAC2_RMII_CLK_MUX_BYPASS_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MAC2_RMII_CLK_MUX_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MAC2_RMII_CLK_MUX_BYPASS_SHIFT)) & DCM_GPR_DCMRWF4_MAC2_RMII_CLK_MUX_BYPASS_MASK)

#define DCM_GPR_DCMRWF4_MAC2_RX_CLK_MUX_BYPASS_MASK (0x60000000U)
#define DCM_GPR_DCMRWF4_MAC2_RX_CLK_MUX_BYPASS_SHIFT (29U)
#define DCM_GPR_DCMRWF4_MAC2_RX_CLK_MUX_BYPASS_WIDTH (2U)
#define DCM_GPR_DCMRWF4_MAC2_RX_CLK_MUX_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MAC2_RX_CLK_MUX_BYPASS_SHIFT)) & DCM_GPR_DCMRWF4_MAC2_RX_CLK_MUX_BYPASS_MASK)

#define DCM_GPR_DCMRWF4_MAC2_TX_CLK_MUX_BYPASS_MASK (0x80000000U)
#define DCM_GPR_DCMRWF4_MAC2_TX_CLK_MUX_BYPASS_SHIFT (31U)
#define DCM_GPR_DCMRWF4_MAC2_TX_CLK_MUX_BYPASS_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MAC2_TX_CLK_MUX_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MAC2_TX_CLK_MUX_BYPASS_SHIFT)) & DCM_GPR_DCMRWF4_MAC2_TX_CLK_MUX_BYPASS_MASK)
/*! @} */

/*! @name DCMRWF5 - Read Write GPR On Functional Reset 5 */
/*! @{ */

#define DCM_GPR_DCMRWF5_BOOT_MODE_MASK           (0x1U)
#define DCM_GPR_DCMRWF5_BOOT_MODE_SHIFT          (0U)
#define DCM_GPR_DCMRWF5_BOOT_MODE_WIDTH          (1U)
#define DCM_GPR_DCMRWF5_BOOT_MODE(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF5_BOOT_MODE_SHIFT)) & DCM_GPR_DCMRWF5_BOOT_MODE_MASK)

#define DCM_GPR_DCMRWF5_BOOT_ADDRESS_MASK        (0xFFFFFFFEU)
#define DCM_GPR_DCMRWF5_BOOT_ADDRESS_SHIFT       (1U)
#define DCM_GPR_DCMRWF5_BOOT_ADDRESS_WIDTH       (31U)
#define DCM_GPR_DCMRWF5_BOOT_ADDRESS(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF5_BOOT_ADDRESS_SHIFT)) & DCM_GPR_DCMRWF5_BOOT_ADDRESS_MASK)
/*! @} */

/*! @name DCMROPP1 - Read-Only GPR On PMCPOR Reset 1 */
/*! @{ */

#define DCM_GPR_DCMROPP1_POR_WDG_STAT0_MASK      (0x1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT0_SHIFT     (0U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT0_WIDTH     (1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT0(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP1_POR_WDG_STAT0_SHIFT)) & DCM_GPR_DCMROPP1_POR_WDG_STAT0_MASK)

#define DCM_GPR_DCMROPP1_POR_WDG_STAT1_MASK      (0x2U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT1_SHIFT     (1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT1_WIDTH     (1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT1(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP1_POR_WDG_STAT1_SHIFT)) & DCM_GPR_DCMROPP1_POR_WDG_STAT1_MASK)

#define DCM_GPR_DCMROPP1_POR_WDG_STAT2_MASK      (0x4U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT2_SHIFT     (2U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT2_WIDTH     (1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT2(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP1_POR_WDG_STAT2_SHIFT)) & DCM_GPR_DCMROPP1_POR_WDG_STAT2_MASK)

#define DCM_GPR_DCMROPP1_POR_WDG_STAT3_MASK      (0x8U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT3_SHIFT     (3U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT3_WIDTH     (1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT3(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP1_POR_WDG_STAT3_SHIFT)) & DCM_GPR_DCMROPP1_POR_WDG_STAT3_MASK)

